In [1]:
# Hands on 1

# List, tuple, set.

list_1=[1,2,3,4,5,6,7,8,9,10]
tup1=(1,2,3,4,5,6,7,8,9,10)
set1={1,2,3,4,5,6,7,8,9,10}

In [ ]:
# pandas Series : 1 dimensional Labelled Datastructure

In [2]:
# Import the required Package

import pandas as pd

In [5]:
S1=pd.Series(list_1,index=['a','b','c','d','e','f','g','h','i','j'])   # Explict way for defining the labels.

In [6]:
S1

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [7]:
type(S1)

pandas.core.series.Series

In [8]:
S2=pd.Series(tup1)

In [9]:
S2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
type(S2)

pandas.core.series.Series

In [11]:
# Set: Unordered , unindex ,unique collection element.

S3=pd.Series(set1)

TypeError: 'set' type is unordered

In [13]:
# set--->list---> Series

sky=list(set1)

In [15]:
type(sky)

list

In [16]:
S3=pd.Series(sky)

In [18]:
S3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
# Data Frame: collection pandas series.

# Stock , finanace

In [19]:
"""Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series."""

'Create a python dictionary with three key value pairs. Keep the keys as the first names,\nand the respective last names as values in the dictionary. Use the dictionary to create a\npandas series.'

In [20]:
# Task 2  Dictionary----> Series.

dict_1={'Virat':'Kohli','Yuvraj':'Singh','Harbhajan':'Singh'}

In [21]:
dict_1

{'Virat': 'Kohli', 'Yuvraj': 'Singh', 'Harbhajan': 'Singh'}

In [30]:
S4=pd.Series(dict_1,index=['Yuvraj','Harbhajan','Virat','Mahendra'])

In [31]:
S4

Yuvraj       Singh
Harbhajan    Singh
Virat        Kohli
Mahendra       NaN
dtype: object

In [32]:
dict_2={'A':90,'C':40,'B':67,'D':86}

In [33]:
S5=pd.Series(dict_2)

In [34]:
S5

A    90
C    40
B    67
D    86
dtype: int64

In [36]:
# Sort the Series 

S5.sort_values(ascending=False)

A    90
D    86
B    67
C    40
dtype: int64

In [37]:
S5.sort_index()

A    90
B    67
C    40
D    86
dtype: int64

In [ ]:
"""Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:
a. Convert it to a list.
b. Convert it to a dictionary.
c. Convert it to a tuple.
d. Convert it to a set.""

In [2]:
import pandas as pd
S6=pd.Series(range(1,11))

In [3]:
S6

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [4]:
# Converting S--->List

L1=list(S6)

In [5]:
L1

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [6]:
type(L1)

list

In [7]:
# Converting S--->tuple
T1=tuple(S6)

In [8]:
T1

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [9]:
type(T1)

tuple

In [10]:
# Converting S---> Dictionary

D1=dict(S6)

In [11]:
D1

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [18]:
# conversion to set

Set_2=set(S6)

In [19]:
Set_2

# Series can be converted to set , but set cannot be converted to Series Directly.

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [ ]:
""""Create a sample pandas series with x integer elements. Perform the following operations
on the same:
a. Print the first 5 elements of the series
b. Print the last 5 elements of the series
c. Insert an integer value ‘50’ at the index 5.
d. Update the last element in the series with the value 100.
e. Delete the first element from the series."""

In [33]:
S7=pd.Series(range(30,45))

In [34]:
S7

0     30
1     31
2     32
3     33
4     34
5     35
6     36
7     37
8     38
9     39
10    40
11    41
12    42
13    43
14    44
dtype: int64

In [35]:
S7.head() # Accessing the First 5 Element

0    30
1    31
2    32
3    33
4    34
dtype: int64

In [36]:
S7[0:5]

0    30
1    31
2    32
3    33
4    34
dtype: int64

In [37]:
S7.tail(7)

8     38
9     39
10    40
11    41
12    42
13    43
14    44
dtype: int64

In [38]:
S7[-5:]  #[-5,-4,-3,-2,-1]

10    40
11    41
12    42
13    43
14    44
dtype: int64

In [39]:
S7

0     30
1     31
2     32
3     33
4     34
5     35
6     36
7     37
8     38
9     39
10    40
11    41
12    42
13    43
14    44
dtype: int64

In [40]:
# Convert List---> Series

my_list=list(S7)

In [41]:
my_list.insert(5,50)

In [42]:
S7=pd.Series(my_list)

In [43]:
S7

0     30
1     31
2     32
3     33
4     34
5     50
6     35
7     36
8     37
9     38
10    39
11    40
12    41
13    42
14    43
15    44
dtype: int64

In [46]:
# Updating the Last.


S7[-1:]=100

In [49]:
S7[15]=100

In [50]:
S7

0      30
1      31
2      32
3      33
4      34
5      50
6      35
7      36
8      37
9      38
10     39
11     40
12     41
13     42
14     43
15    100
dtype: int64

In [52]:
# deleting 

S7=S7.drop(0)

In [53]:
S7

1      31
2      32
3      33
4      34
5      50
6      35
7      36
8      37
9      38
10     39
11     40
12     41
13     42
14     43
15    100
dtype: int64

In [54]:
S7

1      31
2      32
3      33
4      34
5      50
6      35
7      36
8      37
9      38
10     39
11     40
12     41
13     42
14     43
15    100
dtype: int64

In [71]:
# Task 5:

S7

for i in S7:
    if i==39:
        print('Element is Present')
        print(S7[S7==i].index[0])

Element is Present
10

In [66]:
S7[S7==100].index[0]

15

In [72]:
# Task 6

series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [80]:
pd.concat((series_A,series_B),ignore_index=True)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [75]:
S_A=series_A+series_B

In [76]:
S_A

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [81]:
# Task 7

Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [82]:
Sample

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [83]:
for x in Sample:
    print(x)

1
2
3
4
5
6
7
8
9
10

In [91]:
# Data Frame (row and columns): Collection of pandas Series.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24],'Harry':['Mark',25,65]}

In [92]:
Df1=pd.DataFrame(List,columns=['Col1','Col2','Col3'])

In [93]:
Df1

  Col1 Col2 Col3
0   AA   BB   CC
1   DD   EE   FF
2   GG   HH   II

In [99]:
Df2=pd.DataFrame(Dictionary)

In [101]:
Df2.rename(columns={'Kris':'Col A','Memphis':'Col B','Harry':'Col C'})

    Col A  Col B Col C
0  Jordan  Depay  Mark
1      12     23    25
2      22     24    65

In [118]:
dict_3={'Name':['John','Marry','Bob','Henry','Rose'],'Age':[23,12,34,26,32]}

In [119]:
Df3=pd.DataFrame(dict_3)

In [120]:
Df3

    Name  Age
0   John   23
1  Marry   12
2    Bob   34
3  Henry   26
4   Rose   32

In [121]:
Df3.head(3)

    Name  Age
0   John   23
1  Marry   12
2    Bob   34

In [109]:
Df3[0:3]

    Name  Age
0   John   23
1  Marry   12
2    Bob   34

In [ ]:
''''a. Print the first 3 rows of the Data Frame .
b. Print the rows that have the age greater than 15.
c. Insert 5 imaginary names and ages as values to the pandas Data Frame .
d. Update the 5th row so that the name = john and age=56.
e. Delete the first row from the Data Frame

In [111]:
Df3[Df3['Age']>23]

    Name  Age
2    Bob   34
3  Henry   26

In [112]:
Df3['Age']

0    23
1    12
2    34
3    26
Name: Age, dtype: int64

In [122]:
Df3

    Name  Age
0   John   23
1  Marry   12
2    Bob   34
3  Henry   26
4   Rose   32

In [ ]:
# Familiarize

# iloc: accepting the integers as location Specifiers.

# loc: accepting the labels.

In [127]:
Df3.iloc[1,1]

12

In [129]:
Df3.loc[4,'Age']=56

In [130]:
Df3.loc[4,'Name']='John'

In [131]:
Df3

    Name  Age
0   John   23
1  Marry   12
2    Bob   34
3  Henry   26
4   John   56

In [133]:
Df3.loc[len(Df3.index)]=['Harry',45]

In [134]:
Df3

    Name  Age
0   John   23
1  Marry   12
2    Bob   34
3  Henry   26
4   John   56
5  Harry   45

In [135]:
Dict_5={'Name':['X','Y','Z','U'],'Age':[56,43,21,67]}

In [136]:
Df4=pd.DataFrame(Dict_5)

In [137]:
Df4

  Name  Age
0    X   56
1    Y   43
2    Z   21
3    U   67

In [142]:
Df_new=pd.concat([Df3,Df4],ignore_index=True)

In [143]:
Df_new

    Name  Age
0   John   23
1  Marry   12
2    Bob   34
3  Henry   26
4   John   56
5  Harry   45
6      X   56
7      Y   43
8      Z   21
9      U   67

In [144]:
Df_new.dtypes

Name    object
Age      int64
dtype: object

In [145]:
Df_new['Age'].astype(int)

0    23
1    12
2    34
3    26
4    56
5    45
6    56
7    43
8    21
9    67
Name: Age, dtype: int32

In [ ]:
# Dropping the column.

# Addition of column

# Conditional Execution and forming up the Data frame